<?php

use Illuminate\Database\Seeder;
class MinistryTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $ministry = [
            ["name"=>"Աշխատանքի եւ սոցիալական հարցերի նախարարություն"],
            ["name"=>"Առողջապահության նախարարություն"],
            ["name"=>"Արդարադատության նախարարություն"],
            ["name"=>"Արտակարգ իրավիճակների նախարարություն"],
            ["name"=>"Արտաքին գործերի նախարարություն"],
            ["name"=>"Բարձր տեխնոլոգիական արդյունաբերության նախարարություն"],
            ["name"=>"Էկոնոմիկայի նախարարություն"],
            ["name"=>"Կրթության, գիտության, մշակույթի և սպորտի նախարարությու"],
            ["name"=>"Շրջակա միջավայրի նախարարություն"],
            ["name"=>"Պաշտպանության նախարարություն"],
            ["name"=>"Տարածքային կառավարման և ենթակառուցվածքների նախարարություն"],
            ["name"=>"Ֆինանսների նախարարությու"],
            ["name"=>"Երևանի քաղաքապետարան"],
            ["name"=>"Պետական եկամուտների կոմիտե"],
            ["name"=>"Կառավարություն"],
            ["name"=>"Ազգային անվտանգության ծառայություն"],
            ["name"=>"Ոստիկանություն"],
        ];

        foreach($ministry as $val){
            DB::table('ministry')->insert([
                'name' => $val['name'],
            ]);
        }
    }
}
