<?php

use App\Models\Cpv\Cpv;
use App\Models\User\User;
use App\Models\UserCategories\UserCpvs;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Log;

class SetOldCategoriesForUsersSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $users = DB::connection('mysql2')->table('users')->where('user_type', 1)->get();

        foreach ($users as $user) {
            $our_user = User::where('email', $user->user_email)->first();
            if($our_user && $our_user->first_login === 1){
                $user_cats = DB::connection('mysql2')
                    ->table('user_cats')
                    ->where('user_cats.user_id', $user->user_id)
                    ->join("categories","categories.cat_id","user_cats.cat_id")
                    ->get();
                if(count($user_cats)){
                    $cpvsArray = [];
                    foreach ($user_cats as $user_cat) {
                        $cpv_ids = $this->getCpvFromCategory($user_cat->cat_name);
                        if(count($cpv_ids) === 0){
                            $parent = DB::connection('mysql2')
                                ->table('categories')
                                ->where('categories.cat_id', $user_cat->cat_parent)
                                ->first();
                            $cpv_ids = $this->getCpvFromCategory($parent->cat_name);
                        }
                        $cpvs = Cpv::whereIn('id', $cpv_ids)->get();
                        foreach ($cpvs as $cpv) {
                            $cpvsArray[] = $cpv->id;
                            $cpv->getChildren($cpvsArray);
                        }
                    }
                    $cpvs_insert_array = [];
                    foreach($cpvsArray as $cpv) {
                        $cpvs_insert_array[] = [
                            "user_id" => $our_user->id,
                            "cpv_id" => $cpv,
                        ];
                    }
                    if(count($cpvs_insert_array) === 0 ){
                        $our_user->first_login = false;
                        $our_user->save();
                    } else {
                        $our_user->first_login = true;
                        $our_user->save();
                    }
                    UserCpvs::insert($cpvs_insert_array);
                }
            }
        }

       
    }

    public function getCpvFromCategory($category_name){
        $category_cpvs = [
// Ապրանք
            'Արևային կայան' => [11163,2338],
            'Վառելիք' => [11173, 11080],
            'Սննդամթերք' => [10932, 150, 5693],
            'Գրենական պիտույքներ և գրասենյակային նյութեր' => [1479],
            'Դեղորայք և պատվաստանյութեր' => [2994],
            'Ավտոպահեստամասեր' => [3890, 11109],
            'Շինանյութեր' => [1, 6359, 6787, 6916, 6958],
            'Համակարգիչներ և պատճենահանող սարքավորումներ' => [1384, 1691],
            'Գրասենյակային և կենցաղային գույք և կահույք' => [5177],
            'Հանդերձանք և անկողնային պարագաներ' => [5455, 4458],
            'Տնտեսական, սանհիգիենիկ և լվացքի միջոցներ' => [5636, 2077, 3729, 5288],
            'Էլեկտրատեխնիկա, ռադիոտեխնիկա և կենցաղային պարագաներ' => [6906, 5557],
            'Բժշկական սարքավորումներ, գործիքներ և պարագաներ' => [2584],
            'Ավտոմեքենաներ' => [3812],
            'Քիմիական նյութեր' => [1056],
            'Ծաղիկներ' => [10929],
            'Մալուխներ' => [1987, 2568],
            'Սարքեր և սարքավորումներ' => [4843, 5434, 5699, 1845, 2188, 2567, 2575],
            'Կտորեղեն' => [817, 2568],
            'Այլ ապրանքներ' => [6780, 4245, 4318, 4482],
// Աշխատանք
            'Շինարարություն' => [6959, 7713],
            'Տպագրական աշխատանքներ' => [9578, 912],
            'Ֆիլմարտադրություն' => [10042, 7713],
// Ծառայություն
            'Սննդի պատրաստման և մատուցման ծառայություն' => [8346, 8362],
            'Դասընթացների անցկացման ծառայություն' => [9559],
            'Ավիասպասարկում' => [8374],
            'Սարքերի և սարքավորումների սպասարկում' => [7934],
            'Տրանսպորտային փոխադրումներ' => [8367],
            'Ցուցանակների և գովազդային վահանակների պատրաստում և տեղադրում' => [9493],
            'Անվտանգության ծառայություններ' => [9565],
            'Աուդիտորական ծառայություններ' => [9463],
            'Իրավաբանական ծառայություններ' => [9442],
            'Հաշվապահական ծառայություններ' => [9456],
            'Բժշկական ծառայություններ' => [9738],
            'Ֆուրշետների և ճաշկերույթների կազմակերպում' => [9612],
            'Ավտոտեխսպասարկման ծառայություններ' => [7935],
            'Լվացքի և մաքրման ծառայություններ' => [10021],
            'Նախագծանախահաշվային փաստաթղթերի մշակում' => [8735],
            'Համակարգչային ծրագրերի ներդրման և սպասարկման ծառայություններ' => [7718],
            'Ապահովագրական ծառայություններ' => [8638],
            'Մաքսային բրոկերի ծառայություններ' => [9474],
            'Վրանների վարձակալություն' => [8713],
            'Միջոցառումների կազմակերպման ծառայություններ' => [9612],
            'Սեմինարների, կոնֆերանսների կազմակերպում' => [9611],
            'Հյուրանոցային ծառայություններ' => [8322],
            'Տեխնիկական հսկողության ծառայություններ' => [8871],
            'Չափագրման ծառայություններ' => [8755],
            'Անշարժ գույքի գնահատման ծառայություններ' => [11533],
            'Ծրագրավորման ծառայություններ /կայքեր, հավելվածներ, ծրագրեր/' => [8924],
            'Այլ ծառայություններ' => [9537, 9619, 10209],


            'Մետաղապլաստե դռներ և պատուհաններ' => [6542],
            'Վերականգնվող էներգետիկայի հետ կապված աշխատանքներ' => [11155],
            'Կայքերի պատրաստման ծառայություններ' => [8924],
            'Վերելակեր, վերելակների պահեստամասեր' => [5891],
            'Փորձաքննության ծառայություններ' => [8115],
            'Մաքրող և ախտահանող միջոցներ' => [5636],
        ];
        return isset($category_cpvs[trim($category_name)]) ? $category_cpvs[trim($category_name)] : [];
    }
}

