<?php

use Illuminate\Database\Seeder;

class StateInstitutionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $stateInstitution = [
            ["name"=>"Վարչապետին ենթակա մարմիններ"],
            ["name"=>"Ազգային անվտանգության ծառայություն"],
            ["name"=>"Ոստիկանություն"],
            ["name"=>"Պետական վերահսկողական ծառայություն"],
            ["name"=>"Կառավարությանը ենթակա մարմիններ"],
            ["name"=>"Առողջապահական և աշխատանքի տեսչական մարմին"],
            ["name"=>"Բնապահպանության և ընդերքի տեսչական մարմին"],
            ["name"=>"Կադաստրի կոմիտե"],
            ["name"=>"Կրթության տեսչական մարմին"],
            ["name"=>"Միջուկային անվտանգության կարգավորման կոմիտե"],
            ["name"=>"Շուկայի վերահսկողության տեսչական մարմին"],
            ["name"=>"Պետական եկամուտների կոմիտե"],
            ["name"=>"Սննդամթերքի անվտանգության տեսչական մարմին"],
            ["name"=>"Վիճակագրական կոմիտե"],
            ["name"=>"Քաղաքաշինության կոմիտե"],
            ["name"=>"Քաղաքաշինության, տեխնիկական և հրդեհային անվտանգության տեսչական մարմին"],
            ["name"=>"Նախագահի աշխատակազմ"],
            ["name"=>"Ազգային ժողով"],
            ["name"=>"Դատախազություն"],
        ];
 
        foreach($stateInstitution as $val){
            DB::table('state_institution')->insert([
                'name' => $val['name'],
            ]);
        }
    }
}
